# St7SetFreedomCaseName

Sets the name of the specified freedom case within a Strand7 model.

long St7SetFreedomCaseName(long uID, long CaseNum, char* CaseName)
Input Parameters
uID
Strand7 model file ID.
CaseNum
Freedom case number.
CaseName
String containing the new name for the freedom case.